ADLINK/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug

# -----------------------------------
# Adlink I-Pi-OT2IT (SAME54)
# -----------------------------------
adlink_ipi_ot2it.name=Adlink I-Pi-OT2IT (SAME54)

# VID/PID for Bootloader, Arduino & CircuitPython
adlink_ipi_ot2it.vid.0=0x0B63
adlink_ipi_ot2it.pid.0=0xD101
adlink_ipi_ot2it.vid.1=0x0B63
adlink_ipi_ot2it.pid.1=0xD102
adlink_ipi_ot2it.vid.2=0x0B63
adlink_ipi_ot2it.pid.2=0xD103

# Upload
adlink_ipi_ot2it.upload.tool=bossac18
adlink_ipi_ot2it.upload.protocol=sam-ba
adlink_ipi_ot2it.upload.maximum_size=1032192
adlink_ipi_ot2it.upload.offset=0x4000
adlink_ipi_ot2it.upload.use_1200bps_touch=true
adlink_ipi_ot2it.upload.wait_for_upload_port=true
adlink_ipi_ot2it.upload.native_usb=true

# Build
adlink_ipi_ot2it.build.mcu=cortex-m4
adlink_ipi_ot2it.build.f_cpu=120000000L
adlink_ipi_ot2it.build.usb_product="I-Pi-OT2IT"
adlink_ipi_ot2it.build.usb_manufacturer="Adlink"
adlink_ipi_ot2it.build.board=IPI_OT2IT
adlink_ipi_ot2it.build.core=arduino
adlink_ipi_ot2it.build.extra_flags=-D__SAME54P20A__ -DADLINK_IPI_OT2IT -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
adlink_ipi_ot2it.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adlink_ipi_ot2it.build.openocdscript=scripts/openocd/daplink_samd51.cfg
adlink_ipi_ot2it.build.variant=ipi_ot2it
adlink_ipi_ot2it.build.variant_system_lib=
adlink_ipi_ot2it.build.vid=0x0B63
adlink_ipi_ot2it.build.pid=0xD101
adlink_ipi_ot2it.bootloader.tool=openocd
adlink_ipi_ot2it.bootloader.file=ipi_ot2it/bootloader-ot2it.bin
adlink_ipi_ot2it.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu: Cache
adlink_ipi_ot2it.menu.cache.on=Enabled
adlink_ipi_ot2it.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adlink_ipi_ot2it.menu.cache.off=Disabled
adlink_ipi_ot2it.menu.cache.off.build.cache_flags=

# Menu: Speed
adlink_ipi_ot2it.menu.speed.120=120 MHz (standard)
adlink_ipi_ot2it.menu.speed.120.build.f_cpu=120000000L
adlink_ipi_ot2it.menu.speed.150=150 MHz (overclock)
adlink_ipi_ot2it.menu.speed.150.build.f_cpu=150000000L
adlink_ipi_ot2it.menu.speed.180=180 MHz (overclock)
adlink_ipi_ot2it.menu.speed.180.build.f_cpu=180000000L
adlink_ipi_ot2it.menu.speed.200=200 MHz (overclock)
adlink_ipi_ot2it.menu.speed.200.build.f_cpu=200000000L

# Menu: Optimization
adlink_ipi_ot2it.menu.opt.small=Small (-Os) (standard)
adlink_ipi_ot2it.menu.opt.small.build.flags.optimize=-Os
adlink_ipi_ot2it.menu.opt.fast=Fast (-O2)
adlink_ipi_ot2it.menu.opt.fast.build.flags.optimize=-O2
adlink_ipi_ot2it.menu.opt.faster=Faster (-O3)
adlink_ipi_ot2it.menu.opt.faster.build.flags.optimize=-O3
adlink_ipi_ot2it.menu.opt.fastest=Fastest (-Ofast)
adlink_ipi_ot2it.menu.opt.fastest.build.flags.optimize=-Ofast
adlink_ipi_ot2it.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adlink_ipi_ot2it.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: QSPI Speed
adlink_ipi_ot2it.menu.maxqspi.50=50 MHz (standard)
adlink_ipi_ot2it.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adlink_ipi_ot2it.menu.maxqspi.fcpu=CPU Speed / 2
adlink_ipi_ot2it.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})

# Menu: USB Stack
adlink_ipi_ot2it.menu.usbstack.arduino=Arduino
adlink_ipi_ot2it.menu.usbstack.tinyusb=TinyUSB
adlink_ipi_ot2it.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adlink_ipi_ot2it.menu.debug.off=Off
adlink_ipi_ot2it.menu.debug.on=On
adlink_ipi_ot2it.menu.debug.on.build.flags.debug=-g

